## 課題12-2-1

## 以下の作業をするためのSQL文を提出してください。

1. studentsテーブルの中から、class_id列が3でかつtel列が090で始まるデータを抽出し、その最初の2件について、id, f_roman, g_roman, class_id, tel列を表示する　

    >select id,f_roman, g_roman, class_id, tel from students where class_id = 3 and tel like '090%' limit 2;  　

    ![](images/image8.png)  

2. studentsテーブルの中から、id列が 10030から10039までで、かつpref列が Chiba、Ibaraki、Gunma のいずれかのデータを抽出し、その id, f_roman, g_roman, pref列を表示する  

    >select id, f_roman, g_roman, pref from students where id between 10030 and 10039 and pref in ('Chiba', 'Ibaraki', 'Gunma');  

    ![](images/image9.png)  

3. studentsテーブルの中から、pref列が Tokyo で、tel列には値が入っているデータを抽出し、class_id列の昇順にすべての列を表示する。  

    >select * from students where pref = 'Tokyo' and tel is not null order by class_id;

    ![](images/image10.png)